## Pandas

#### Instructor: Dan Wang

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## 1 Introduction to pandas Data Structures

### 1.1 Seris

In [2]:
li = [4, 7, -5, 3]
li

[4, 7, -5, 3]

In [3]:
np.array(li)

array([ 4,  7, -5,  3])

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 5
obj2

d    5
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2 > 0

d     True
b     True
a    False
c     True
dtype: bool

In [12]:
obj2[obj2 > 0]

d    5
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    10
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d     148.413159
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
0.006738 in obj2

False

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': np.NaN}
obj3 = Series(sdata)
obj3

Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah          NaN
dtype: float64

In [18]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index= states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj3

Ohio      35000.0
Texas     71000.0
Oregon    16000.0
Utah          NaN
dtype: float64

In [22]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [23]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

### 1.2 DataFrame

In [47]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [48]:
obj = Series(data)

In [49]:
obj

state    [Ohio, Ohio, Ohio, Nevada, Nevada]
year         [2000, 2001, 2002, 2001, 2002]
pop               [1.5, 1.7, 3.6, 2.4, 2.9]
dtype: object

In [50]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [51]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [52]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

In [53]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [54]:
frame2[['state','year']]

        state  year
one      Ohio  2000
two      Ohio  2001
three    Ohio  2002
four   Nevada  2001
five   Nevada  2002

In [55]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [56]:
frame2.year + 1

one      2001
two      2002
three    2003
four     2002
five     2003
Name: year, dtype: int64

In [57]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [58]:
frame2.T.one

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [59]:
frame2.iloc[2:4,2:]

       pop debt
three  3.6  NaN
four   2.4  NaN

In [60]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [61]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [62]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [64]:
frame2['debt1'] = 999
frame2

       year   state  pop  debt  debt1
one    2000    Ohio  1.5   NaN    999
two    2001    Ohio  1.7  -1.2    999
three  2002    Ohio  3.6   NaN    999
four   2001  Nevada  2.4  -1.5    999
five   2002  Nevada  2.9  -1.7    999

In [65]:
frame2.state == 'Ohio'

one       True
two       True
three     True
four     False
five     False
Name: state, dtype: bool

In [66]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  debt1  eastern
one    2000    Ohio  1.5   NaN    999     True
two    2001    Ohio  1.7  -1.2    999     True
three  2002    Ohio  3.6   NaN    999     True
four   2001  Nevada  2.4  -1.5    999    False
five   2002  Nevada  2.9  -1.7    999    False

In [67]:
del frame2['eastern']
frame2

       year   state  pop  debt  debt1
one    2000    Ohio  1.5   NaN    999
two    2001    Ohio  1.7  -1.2    999
three  2002    Ohio  3.6   NaN    999
four   2001  Nevada  2.4  -1.5    999
five   2002  Nevada  2.9  -1.7    999

In [68]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [ ]:
frame3.T

In [69]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

## 2 Essential Functionality

### 2.1 Reindexing

In [70]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [75]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [76]:
obj2.fillna(12)

a    -5.3
b     7.2
c     3.6
d     4.5
e    12.0
dtype: float64

In [77]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=12)

a    -5.3
b     7.2
c     3.6
d     4.5
e    12.0
dtype: float64

In [78]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [84]:
obj3.reindex(range(6),  method='bfill') #bfill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [85]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [86]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'], method ='ffill')
frame2

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

### 2.2 Dropping entries from an axis

In [87]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [88]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [89]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [90]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [94]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

### 2.3 Indexing, selection, and filtering

In [95]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [96]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [97]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [98]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [99]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [101]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [102]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [109]:
data[2:]

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [104]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [119]:
data.loc[['Colorado', 'Utah'], 'two']

Colorado    5
Utah        9
Name: two, dtype: int64

In [117]:
data.iloc[1:, 1:]

          two  three  four
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [116]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [120]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

/Users/DanWang/anaconda3/envs/python36/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [46]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [47]:
data.ix[data.three > 5, :3]

/Users/DanWang/anaconda3/envs/python36/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/Users/DanWang/anaconda3/envs/python36/lib/python3.6/site-packages/pandas/core/indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 2.4 Arithmetic and data alignment

In [121]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [122]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [123]:
s1.values

array([ 7.3, -2.5,  3.4,  1.5])

In [129]:
(s1 + s2).fillna(0)

a    5.2
c    1.1
d    0.0
e    0.0
f    0.0
g    0.0
dtype: float64

In [130]:
s1.add(s2, fill_value=0)

a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

### 2.5 Function application and mapping

In [131]:
frame = DataFrame(np.random.randn(4, 3), 
                  columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [132]:
frame

               b         d         e
Utah    0.461892 -0.500397 -1.117661
Ohio   -0.510373 -0.221446  0.477173
Texas  -0.060816 -0.855740 -1.852926
Oregon -0.061652 -0.868930  0.004395

In [133]:
np.abs(frame)

               b         d         e
Utah    0.461892  0.500397  1.117661
Ohio    0.510373  0.221446  0.477173
Texas   0.060816  0.855740  1.852926
Oregon  0.061652  0.868930  0.004395

In [134]:
frame

               b         d         e
Utah    0.461892 -0.500397 -1.117661
Ohio   -0.510373 -0.221446  0.477173
Texas  -0.060816 -0.855740 -1.852926
Oregon -0.061652 -0.868930  0.004395

In [143]:
def ran(x):
    print (x['Utah'])
    return np.abs(x).max() - np.abs(x).min()

In [136]:
f = lambda x: np.abs(x).max() - np.abs(x).min()

In [144]:
frame.apply(ran)
#frame.map(f)

0.46189160852172473
-0.500396741591496
-1.1176607751179082

b    0.449557
d    0.647483
e    1.848530
dtype: float64

In [149]:
def f(x):
    return Series([x.count(), x.mean(), x.min(), x.max()], index=['count','mean','min', 'max'])
frame.apply(f)

              b         d         e
count  4.000000  4.000000  4.000000
mean  -0.042737 -0.611628 -0.622255
min   -0.510373 -0.868930 -1.852926
max    0.461892 -0.221446  0.477173

In [147]:
frame.describe()

              b         d         e
count  4.000000  4.000000  4.000000
mean  -0.042737 -0.611628 -0.622255
std    0.397500  0.311132  1.058523
min   -0.510373 -0.868930 -1.852926
25%   -0.173832 -0.859038 -1.301477
50%   -0.061234 -0.678069 -0.556633
75%    0.069861 -0.430659  0.122590
max    0.461892 -0.221446  0.477173

### 2.5 Sorting and ranking

In [150]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [151]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [152]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [153]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [154]:
frame.sort_index(1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [155]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [157]:
frame = DataFrame({'p/e': [4, 7, -3, 2], 'p/s': [0, 1, 0, 1]})
frame

   p/e  p/s
0    4    0
1    7    1
2   -3    0
3    2    1

In [158]:
frame.sort_values(by='p/e')

   p/e  p/s
2   -3    0
3    2    1
0    4    0
1    7    1

In [80]:
frame.sort_values(by=['p/s','p/e'])

   p/e  p/s
2   -3    0
0    4    0
3    2    1
1    7    1

### Correlation and Covariance

In [159]:
ret = DataFrame(np.random.rand(400).reshape((100, 4)),columns=['AAPL', 'GD', 'IBM', 'MSFT'])
ret

        AAPL        GD       IBM      MSFT
0   0.863581  0.686588  0.229107  0.201551
1   0.961652  0.847483  0.087330  0.416860
2   0.055158  0.379115  0.459199  0.197875
3   0.520862  0.791820  0.969594  0.415654
4   0.226461  0.125576  0.605098  0.930017
..       ...       ...       ...       ...
95  0.402304  0.269019  0.415819  0.694817
96  0.335588  0.587047  0.685374  0.258626
97  0.479261  0.566618  0.015795  0.145482
98  0.707547  0.820937  0.412482  0.673025
99  0.770211  0.651095  0.684776  0.851663

[100 rows x 4 columns]

In [160]:
ret.corr()

          AAPL        GD       IBM      MSFT
AAPL  1.000000  0.170135 -0.034506  0.027173
GD    0.170135  1.000000  0.139577  0.010997
IBM  -0.034506  0.139577  1.000000 -0.038955
MSFT  0.027173  0.010997 -0.038955  1.000000

In [161]:
ret.cov()

          AAPL        GD       IBM      MSFT
AAPL  0.080221  0.012623 -0.002789  0.002129
GD    0.012623  0.068620  0.010435  0.000797
IBM  -0.002789  0.010435  0.081448 -0.003076
MSFT  0.002129  0.000797 -0.003076  0.076531

## Deal with missing data

In [162]:
from numpy import nan as NA

In [163]:
data = DataFrame([[1., 6.5, 4.], [1., NA, NA],
.....: [NA, NA, NA], [NA, 6, 9.]])
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [167]:
cleaned = data.dropna(thresh = 2)
cleaned

     0    1    2
0  1.0  6.5  4.0
3  NaN  6.0  9.0

In [168]:
data.fillna(0)

     0    1    2
0  1.0  6.5  4.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.0  9.0

In [169]:
data

     0    1    2
0  1.0  6.5  4.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  9.0

In [170]:
data.fillna(method='ffill')

     0    1    2
0  1.0  6.5  4.0
1  1.0  6.5  4.0
2  1.0  6.5  4.0
3  1.0  6.0  9.0

In [171]:
data.fillna(data.mean())

     0     1    2
0  1.0  6.50  4.0
1  1.0  6.25  6.5
2  1.0  6.25  6.5
3  1.0  6.00  9.0

In [173]:
s = pd.Series([0, 1, np.nan,np.nan,np.nan, 3])
s

0    0.0
1    1.0
2    NaN
3    NaN
4    NaN
5    3.0
dtype: float64

In [174]:
s.interpolate()

0    0.0
1    1.0
2    1.5
3    2.0
4    2.5
5    3.0
dtype: float64